

TEACHER_FIXES_DICTIONARY = {
    '?міртай Э. Т.': 'Әміртай Э. Т.',
    'К': 'Куратор',
    'С?лтан Р. М.': 'Сұлтан Р. М.',
    'У': 'Учитель',
    'У?лихан А.': 'Уәлихан А.',
    'Н?рма?амбет Д.': 'Нұрмағамбет Д.',
    'АА': 'Химик',
    'ББ': 'Куратор',
    'В': 'Физик',
    'А': 'Асель',
    'ДТ': 'Биолог',
}


CLASSROOM_FIXES_DICTIONARY = {
    'МСЗ': 'Малый Спорт Зал',
    'СЗ': 'Спорт Зал',
}


SUBJECT_FIXES_DICTIONARY = {
    "IELTS": "IELTS",
    "SAT Eng": "SAT English",
    "SAT Math": "SAT Math",
    "Человек. Общество. Право (Основы права)": "Основы права",
    "Русский язык и литература": "Русский",
    "Русская литература": "Русская литература",
    "Русский язык": "Русский",
    "Казахский язык": "Казахский",
    "Казахская литература": "Казахская литература",
    "Казахский язык и литература": "Казахский",
    "Английский язык": "Английский",
    "Мат PISA": "Математика PISA",
    "Каз PISA": "Казахский PISA",
    "Рус PISA": "Русский PISA",
    "Физика ВСО/PISA": "Физика ВСО",
    "Казахский язык ВСО": "Казахский ВСО",
    "Информатика ВСО/PISA": "Информатика ВСО",
    "Химия ВСО/PISA": "Химия ВСО",
    "Биология ВСО/PISA": "Биология ВСО",
    "Биология ВСО": "Биология ВСО",
    "Химия ВСО": "Химия ВСО",
    "Физика ВСО": "Физика ВСО",
    "Информатика ВСО": "Информатика ВСО",
    "Математика ВСО": "Математика ВСО",
    "История Казахстана ВСО": "История Казахстана ВСО",
    "Русский язык ВСО": "Русский ВСО",
    "Химия(Углубленная)": "Химия",
    "Биология(Углубленная)": "Биология",
    "Информатика(Углубленная)": "Информатика",
    "Физика(Углубленная)": "Физика",
    "География(Стандартная)": "География",
    "Экономика(Стандартная)": "Экономика",
    "Графика и проектирование(Стандартная)": "ГИП",
    "Математика(7)": "Математика",
    "Математика(10)": "Математика (10)",
    "Програм.": "Программирование",
    "История Казахстана (Казахстан в современном мире)": "КСМ",
    "Физика Доп.": "Физика Доп",
    "Физическая культура": "Физ-ра",
    "Глобальные перспективы и проектные работы": "GPPW",
    "Начальная военная и технологическая подготовка": "НВП",
    "Человек. Общество. Право (Основы права)": "Основы Права",
}


DAYS = (
    None,
    'monday',
    'tuesday',
    'wednesday',
    'thursday',
    'friday',
    'saturday',
    'sunday',
)


SERVER_DOMAIN = 'http://localhost:8000/'
