from enum import Enum

from apps.core import models

MODELS = {
    'teachers': models.Teacher
}

TIMETABLE_DATABASE_LINK = 'https://fmalmnis.edupage.org/rpr/server/maindbi.js?__func=mainDBIAccessor'
TIMETABLE_LESSONS_LINK = 'https://fmalmnis.edupage.org/timetable/server/currenttt.js?__func=curentttGetData'
SCHOOL_NAME = 'Nazarbayev Intellectual school of the Physics and Mathematics'
CITY_NAME = 'Almaty'


class TimetableIndexes(Enum):
    teachers = 0
    subjects = 1
    classrooms = 2
    classes = 3
    periods = 4


TEACHER_CHANGES = {
    '?міртай Э. Т.': 'Әміртай Э. Т.',
    'С?лтан Р. М.': 'Сұлтан Р. М.',
    'У?лихан А.': 'Уәлихан А.',
    'К': 'Куратор',
    'У': 'Учитель',
}

SUBJECT_CHANGES = {
    "Русский язык и литература": "Русский",
    "Русская литература": "Русская литература",
    "Русский язык": "Русский",
    "Казахский язык": "Казахский",
    "Казахская литература": "Казахская литература",
    "Казахский язык и литература": "Казахский",
    "Английский язык": "Английский",
    "Мат PISA": "Математика PISA",
    "Каз PISA": "Казахский PISA",
    "Рус PISA": "Русский PISA",
    "Физика ВСО/PISA": "Физика ВСО",
    "Казахский язык ВСО": "Казахский ВСО",
    "Информатика ВСО/PISA": "Информатика ВСО",
    "Химия ВСО/PISA": "Химия ВСО",
    "Биология ВСО/PISA": "Биология ВСО",
    "Русский язык ВСО": "Русский ВСО",
    "Химия(Углубленная)": "Химия",
    "Биология(Углубленная)": "Биология",
    "Информатика(Углубленная)": "Информатика",
    "Физика(Углубленная)": "Физика",
    "География(Стандартная)": "География",
    "Экономика(Стандартная)": "Экономика",
    "Графика и проектирование(Стандартная)": "ГИП",
    "Математика(7)": "Математика",
    "Математика(10)": "Математика (10)",
    "Програм.": "Программирование",
    "История Казахстана (Казахстан в современном мире)": "КСМ",
    "Физика Доп.": "Физика Доп",
    "Физическая культура": "Физ-ра",
    "Глобальные перспективы и проектные работы": "GPPW",
    "Начальная военная и технологическая подготовка": "НВП",
    "Человек. Общество. Право (Основы права)": "Основы Права",
}

CLASSROOM_CHANGES = {
    'МСЗ': 'Малый Спорт Зал',
    'СЗ': 'Спорт Зал'
}

DAYS = (
    'monday',
    'tuesday',
    'wednesday',
    'thursday',
    'friday',
    'saturday',
    'sunday'
)
